package lesson_1;

import java.util.Scanner;

public class For {
    public static void main(String[] args) {
        // for (счётчики(переменные); условие; инкремент_счётчиком) {
        //     действия
        // }

//        Scanner cin = new Scanner(System.in);
//
//        int arrSize = cin.nextInt();
//        int[] arr = new int[arrSize];
//
//        for (int i = 0; i < arrSize; i++) {
//            arr[i] = cin.nextInt();
//        }
//
//        for (int i = 0; i < arrSize; i++) {
//            System.out.print(arr[i] + " ");
//        }

        // break - прерывает наш цикл
//        for(int i = 0; i < 5; i++) {
//            if (i == 3) {
//                break;
//            }
//            System.out.println(i);
//        }

        // continue - прерывает итерацию
//        for(int i = 0; i < 5; i++) {
//            System.out.println(i);
//
//            if (i == 3) {
//                continue;
//            }
//        }

        // TODO
        // Дан массив. Определить сумму его элементов, количество чётных элементов.
        // Определить количество локальных минимумов.
        //
        // Ввод::
        // N
        // N элементов

        // 10
        // 1 5 2 3 7 2 0 9 3 4
        // --> sum
        // --> count
        // --> 4

    }
}
